<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/1%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B05(0726).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friend_list=[
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
from collections import OrderedDict
df=pd.DataFrame.from_dict(OrderedDict(friend_list))#pd.DataFrame.from_items는 불가능

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df#df자체는 수정되지 않았기 때문에 원래대로 0의 인덱스부터 표시

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df =df[1:3]

In [ ]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
friend_list=[
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df=pd.DataFrame.from_dict(OrderedDict(friend_list))

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.loc[[0,2]]#0,2 인덱스만을 원할 때

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
df =df.loc[[0,2]]

In [ ]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
friend_list=[
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df=pd.DataFrame.from_dict(OrderedDict(friend_list))

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[df.age>25]#쿼리와 비슷하다고 함, 25age 이상만 원하는 경우

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.query('age>25')#쿼리

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[(df.age>25)&(df.name=='Nate')]#25age이상 및 name이 Nate인 조건에 맞는 데이터만 표시

   name  age      job
2  Nate   30  teacher

In [ ]:
friend_list=[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
df=pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [ ]:
df.iloc[:,0:2]#앞부분은 row의미,:뿐이니 전부. , 뒷부분은 column 의미

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [ ]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [ ]:
df =pd.read_csv('data/friend_list_no_head.csv',header=None,names=['name','age','job'])

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df_filtered=df[['name','age']]#헤더 name을 이용하여 필터하는 방법

In [ ]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df.filter(like='a',axis=1)#컬럼은 언제나 axis=1임,헤더 이름에 a가 들어가는 것만 필터

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df.filter(regex='b$',axis=1)#b로 끝나는것으로만.

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [ ]:
df.filter(regex='e$',axis=1)#헤더에서 e로 끝나는 것으로만

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25